Revit 2027 API
ParameterTypeId.SteelElemHoleDefinition Property
 "Hole Definition"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SteelElemHoleDefinition { get; }
Public Shared ReadOnly Property SteelElemHoleDefinition As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SteelElemHoleDefinition {
	ForgeTypeId^ get ();
}
static member SteelElemHoleDefinition : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace